In [1]:
import pandas as pd
import numpy as np 
import env

In [2]:
url = env.get_db_url('employees')
sql = 'SELECT * FROM employees;'
df = pd.read_sql(sql, url)

In [3]:
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

-- Write a query to to find all employees whose last name starts and ends with 'E'. 
combine their first and last name together as a single column 
named full_name.

In [4]:
(
    df[df.last_name.str.startswith('E') & df.last_name.str.endswith('e')].first_name
    + ' '
    + df[df.last_name.str.startswith('E') & df.last_name.str.endswith('e')].last_name
)

20                Ramzi Erde
130       Magdalena Eldridge
249             Serap Etalle
260                Mang Erie
303               Bernt Erie
                 ...
298161    Christfried Etalle
298393            Remco Erie
298432      Yuchang Eldridge
299018     Seongbin Eldridge
299672         Tadahiro Erde
Length: 899, dtype: object

-- Convert the names produced in your last query to all uppercase.

In [5]:
(
    df[df.last_name.str.startswith('E') & df.last_name.str.endswith('e')].first_name
    + ' '
    + df[df.last_name.str.startswith('E') & df.last_name.str.endswith('e')].last_name
).str.upper()

20                RAMZI ERDE
130       MAGDALENA ELDRIDGE
249             SERAP ETALLE
260                MANG ERIE
303               BERNT ERIE
                 ...
298161    CHRISTFRIED ETALLE
298393            REMCO ERIE
298432      YUCHANG ELDRIDGE
299018     SEONGBIN ELDRIDGE
299672         TADAHIRO ERDE
Length: 899, dtype: object

-- Find all employees hired in the 90s and born on 
-- Christmas. Use datediff() function to find how many 
-- days they have been working at the company (Hint: 
-- You will also need to use NOW() or CURDATE()),

In [6]:
pd.datetime.today().date() - df[
                                df.hire_date.astype(str).str.startswith('199') 
                                & df.birth_date.astype(str).str.endswith('-12-25')
                               ].hire_date

/var/folders/zb/3lg9b5xn3831bhkh23bd5bs00000gn/T/ipykernel_21886/2733074068.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  pd.datetime.today().date() - df[

260      10471 days
437      11841 days
680      10831 days
709      11120 days
1806     10937 days
            ...
290768   11850 days
293103   10484 days
293974    9559 days
294516   11636 days
297902    9901 days
Name: hire_date, Length: 362, dtype: timedelta64[ns]

-- Use your knowledge of built in SQL functions to 
generate a username for all of the employees. A 
username should be all lowercase, and consist of the 
first character of the employees first name, the 
first 4 characters of the employees last name, an 
underscore, the month the employee was born, and 
the last two digits of the year that they were born.

In [7]:
(df.first_name.str[0] 
  + df.last_name.str[0:4]
  + '_'
  + df.birth_date.astype(str).str[5:7]
  + df.birth_date.astype(str).str[2:4]
).str.lower()

0         gface_0953
1         bsimm_0664
2         pbamf_1259
3         ckobl_0554
4         kmali_0155
             ...
300019    dlich_0958
300020    zbaaz_0353
300021    blena_0861
300022    pbreu_0956
300023    stsuk_0558
Length: 300024, dtype: object